{
    "result": [
        {
            "title": "hacker rank",
            "description": "HackerRank es una plataforma de contratación de tecnología que es el estándar para evaluar las habilidades de los desarrolladores para más de 3,000+ empresas en todo el mundo. Al permitir que los reclutadores de tecnología y los gerentes de contratación evalúen objetivamente el talento en cada etapa del proceso de reclutamiento, HackerRank ayuda a las empresas a contratar desarrolladores calificados e innovar más rápido.",
            "url": "https://www.hackerrank.com/",
            "tags": ["practica", "logica", "programacion", "trabajo", "ejercicios", "certificacion"],
            "imageUrl": "https://www.svgrepo.com/show/408457/image-landscape-png.svg"
        },
        {
            "title": "code signal",
            "description": "Obtenga su informe de codificación y prepárese para las entrevistas. Realice nuestra evaluación certificada para ver cómo se compara con el resto de la industria.",
            "url": "https://app.codesignal.com/login",
            "tags": ["practica", "logica", "programacion", "trabajo", "ejercicios"],
            "imageUrl": "https://www.svgrepo.com/show/408457/image-landscape-png.svg"
        },
        {
            "title": "exercism",
            "description": "Exercism es una plataforma donde cualquiera puede aprender y dominar la programación de forma gratuita, sin sentirse perdido o estúpido. No solo contiene ejercicios de lógica sino que tambien añaden explicaciones.",
            "url": "https://exercism.org/",
            "tags": ["practica", "logica", "programacion", "ejercicios"],
            "imageUrl": "https://www.svgrepo.com/show/408457/image-landscape-png.svg"
        },
        {
            "title": "leet code",
            "description": "En LeetCode, nuestra misión es ayudarte a mejorar y conseguir el trabajo de tus sueños. Contamos con un repositorio considerable de recursos de entrevistas para muchas empresas. En los últimos años, nuestros usuarios han conseguido trabajos en las principales empresas de todo el mundo. Ahora admitimos 14 lenguajes de codificación populares. En esencia, LeetCode se trata de desarrolladores. Nuestras potentes herramientas de desarrollo, como Playground, te ayudan a probar, depurar e incluso escribir tus propios proyectos en línea.",
            "url": "https://leetcode.com/",
            "tags": ["practica", "logica", "programacion", "trabajo", "ejercicios"],
            "imageUrl": "https://www.svgrepo.com/show/408457/image-landscape-png.svg"
        },
        {
            "title": "edabit",
            "description": "Aprenda a codificar con más de 10,000 desafíos interactivos. Obtén XP, desbloquea logros y sube de nivel. Es un atajo a través del laberinto de codificación.",
            "url": "https://edabit.com/",
            "tags": ["practica", "logica", "programacion", "ejercicios"],
            "imageUrl": "https://www.svgrepo.com/show/408457/image-landscape-png.svg"
        },
        {
            "title": "project euler",
            "description": "El Proyecto Euler es una serie de desafiantes problemas matemáticos/de programación informática que requerirán algo más que conocimientos matemáticos para resolverlos. Aunque las matemáticas te ayudarán a llegar a métodos elegantes y eficientes, se requerirá el uso de una computadora y habilidades de programación para resolver la mayoría de los problemas.",
            "url": "https://projecteuler.net/about",
            "tags": ["practica", "logica", "programacion", "trabajo", "ejercicios", "matematica"],
            "imageUrl": "https://www.svgrepo.com/show/408457/image-landscape-png.svg"
        }
    ]
}